balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F96J65.PIC
          <edc:SFRDef edc:access="---nnnnn" edc:cname="EDMANDH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="EDMANDH" edc:nzwidth="0x8" edc:por="---00000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="EDMANDH" edc:desc="" edc:islanghidden="true" edc:mask="0x1f" edc:name="EDMANDH" edc:nzwidth="0x5"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="EDMADST" edc:desc="" edc:name="EDMADST" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="EDMADSTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="EDMADSTL" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="EDMADSTL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="EDMADSTL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="---nnnnn" edc:cname="EDMADSTH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="EDMADSTH" edc:nzwidth="0x8" edc:por="---00000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="EDMADSTH" edc:desc="" edc:islanghidden="true" edc:mask="0x1f" edc:name="EDMADSTH" edc:nzwidth="0x5"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="EDMACS" edc:desc="" edc:name="EDMACS" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="EDMACSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="EDMACSL" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="EDMASCL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="EDMASCL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="EDMACSH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="EDMACSH" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="EDMASCH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="EDMASCH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:AdjustPoint edc:offset="3"/>
        <edc:SFRDef edc:access="-nnnn-nn" edc:cname="EIE" edc:desc="" edc:impl="0x7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000-00" edc:name="EIE" edc:nzwidth="0x8" edc:por="-0000-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXERIE" edc:desc="" edc:mask="0x1" edc:name="RXERIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERIE" edc:desc="" edc:mask="0x1" edc:name="TXERIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TXIE" edc:desc="" edc:mask="0x1" edc:name="TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LINKIE" edc:desc="" edc:mask="0x1" edc:name="LINKIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMAIE" edc:desc="" edc:mask="0x1" edc:name="DMAIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PKTIE" edc:desc="" edc:mask="0x1" edc:name="PKTIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ETXIE" edc:desc="" edc:mask="0x1" edc:name="ETXIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="-c-c-rcn" edc:cname="ESTAT" edc:desc="" edc:impl="0x57" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0-0-000" edc:name="ESTAT" edc:nzwidth="0x8" edc:por="-0-0-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHYRDY" edc:desc="" edc:mask="0x1" edc:name="PHYRDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXABRT" edc:desc="" edc:mask="0x1" edc:name="TXABRT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXBUSY" edc:desc="" edc:mask="0x1" edc:name="RXBUSY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LATECOL" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="LATECOL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BUFER" edc:desc="" edc:mask="0x1" edc:name="BUFER" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="ECON2" edc:desc="" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="100-----" edc:name="ECON2" edc:nzwidth="0x8" edc:por="100-----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="ETHEN" edc:desc="" edc:mask="0x1" edc:name="ETHEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PKTDEC" edc:desc="" edc:mask="0x1" edc:name="PKTDEC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AUTOINC" edc:desc="" edc:mask="0x1" edc:name="AUTOINC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf60" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:SFRDef edc:access="-rcrc-cc" edc:cname="EIR" edc:desc="" edc:impl="0x7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000-00" edc:name="EIR" edc:nzwidth="0x8" edc:por="-0000-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXERIF" edc:desc="" edc:mask="0x1" edc:name="RXERIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERIF" edc:desc="" edc:mask="0x1" edc:name="TXERIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TXIF" edc:desc="" edc:mask="0x1" edc:name="TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LINKIF" edc:desc="" edc:mask="0x1" edc:name="LINKIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMAIF" edc:desc="" edc:mask="0x1" edc:name="DMAIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PKTIF" edc:desc="" edc:mask="0x1" edc:name="PKTIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------" edc:cname="EDATA" edc:desc="" edc:impl="0x0" edc:isindirect="true" edc:isvolatile="true" edc:mclr="--------" edc:name="EDATA" edc:nzwidth="0x8" edc:por="--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EDATA" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="EDATA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EDATA0" edc:desc="" edc:mask="0x1" edc:name="EDATA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDATA1" edc:desc="" edc:mask="0x1" edc:name="EDATA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDATA2" edc:desc="" edc:mask="0x1" edc:name="EDATA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDATA3" edc:desc="" edc:mask="0x1" edc:name="EDATA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDATA4" edc:desc="" edc:mask="0x1" edc:name="EDATA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDATA5" edc:desc="" edc:mask="0x1" edc:name="EDATA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDATA6" edc:desc="" edc:mask="0x1" edc:name="EDATA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EDATA7" edc:desc="" edc:mask="0x1" edc:name="EDATA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
